{"pageProps":{"postData":{"id":"2022-05-09-new-blog-with-nextjs-tailwind","year":"2022","title":"A new website and blog with Next.js and Tailwind CSS","date":"09-05-2022 16:35","tags":["nextjs","tailwindcss","web"],"excerpt":"It is time for a new blog post and the first ever English post! In the past few years, my work has been mostly relied on styled-components for styling React projects I have been working on. Recently, I have got a chance to try something new (during the late recovery from COVID-19) and I picked Chakra UI and Tailwind CSS. The experience so far is great but there are still many things to learn.","contentHtml":"<p>It is time for a new blog post and the first ever English post! In the past few years, my work has been mostly relied on <a href=\"%5Bhttps://%5D(https://styled-components.com/)\">styled-components</a> for styling React projects I have been working on. Recently, I have got a chance to try something new (during the late recovery from COVID-19) and I picked <a href=\"https://chakra-ui.com/\">Chakra UI</a> and <a href=\"https://tailwindcss.com/\">Tailwind CSS</a>. The experience so far is great but there are still many things to learn.</p>\n<p>I have finished a couple of small projects using Chakra UI in the past months and feel that Chakra UI is so good at providing base styles and utilities so we can focus on the other tasks at hand rather than the design. That said, the customization is fairly good, not so much constrain. However, my soon to spin off project will need to be more easily to transfer to the other team members, so I think I should try another library which is favored by a community (felt by my gut feeling 😬) and I am going with Tailwind CSS.</p>\n<h2>Tailwind CSS</h2>\n<p>In order to prepare myself for the next project, I try playing and researhing around to improve my knowledge to be able to decide whether to actually go with Tailwind CSS or not. And that is when I found a post by <a href=\"https://www.facebook.com/events/5398524660192656/?post_id=5402035836508205&#x26;view=permalink\">Code in the Wind #1</a> and learned about <a href=\"https://play.tailwindcss.com/\">tailwindPLAY</a>. In that post there is an example question so I tried drawing without previous knowledge about Tailwind CSS and once I finished the question, I gained some confidence to try it out more.</p>\n<h2>A new website</h2>\n<p>My personal website domain (https://bluenex.dev) was a simple blog built by <a href=\"https://github.com/barryclark/jekyll-now\">Jekyll Now</a> and served on GitHub Pages. My goal this time was to build a new personal website using Next.js and Tailwind CSS with TypeScript and still deploy on GitHub Pages.</p>\n<p>The experience with Tailwind CSS is great and I am very happy with the result.</p>\n<h3>Issue</h3>\n<p>To deploy on GitHub Pages, the site has to be exported with <code>next export</code> and with that, <a href=\"https://nextjs.org/docs/advanced-features/static-html-export\">some of the features are not available</a>. One of the features that I initially need to use is the <code>getServerSideProps</code> to get tags and years of all posts for navigation in <code>/blog</code> route. However, it is not supported by static export.</p>\n<p>Considering that this data won't be changed unless I added a new post. I workaround this by implementing a script to run before <code>npm run dev</code> called <code>predev.js</code> to gather all the tags and years and store as a <code>static-data.json</code>. The only thing I need to be aware is to not forget running <code>npm run dev</code> or <code>npm run predev</code> before deploying.</p>\n<h2>Summary</h2>\n<p>The site is now up and running on https://bluenex.dev. The design is the bare minimum I can think of by myself to satisfy my expectations. This personal website project is actually a good start for the upcoming project. There are more to improve and I will be back to this project from time to time.</p>\n<p>This is my first post in English so the language may not be natural. Anyway, I hope it is readable and helpful for others who want to start something new.</p>\n"}},"__N_SSG":true}